// Generated by jextract

package org.purejava.linux;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _GdkEventKey {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_INT$LAYOUT.withName("type"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("window"),
        Constants$root.C_CHAR$LAYOUT.withName("send_event"),
        MemoryLayout.paddingLayout(24),
        Constants$root.C_INT$LAYOUT.withName("time"),
        Constants$root.C_INT$LAYOUT.withName("state"),
        Constants$root.C_INT$LAYOUT.withName("keyval"),
        Constants$root.C_INT$LAYOUT.withName("length"),
        MemoryLayout.paddingLayout(32),
        Constants$root.C_POINTER$LAYOUT.withName("string"),
        Constants$root.C_SHORT$LAYOUT.withName("hardware_keycode"),
        Constants$root.C_CHAR$LAYOUT.withName("group"),
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(1).withName("is_modifier"),
            MemoryLayout.paddingLayout(39)
        )
    ).withName("_GdkEventKey");
    public static MemoryLayout $LAYOUT() {
        return _GdkEventKey.$struct$LAYOUT;
    }
    static final VarHandle type$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("type"));
    public static VarHandle type$VH() {
        return _GdkEventKey.type$VH;
    }
    public static int type$get(MemorySegment seg) {
        return (int)_GdkEventKey.type$VH.get(seg);
    }
    public static void type$set( MemorySegment seg, int x) {
        _GdkEventKey.type$VH.set(seg, x);
    }
    public static int type$get(MemorySegment seg, long index) {
        return (int)_GdkEventKey.type$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void type$set(MemorySegment seg, long index, int x) {
        _GdkEventKey.type$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle window$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("window"));
    public static VarHandle window$VH() {
        return _GdkEventKey.window$VH;
    }
    public static MemoryAddress window$get(MemorySegment seg) {
        return (java.lang.foreign.MemoryAddress)_GdkEventKey.window$VH.get(seg);
    }
    public static void window$set( MemorySegment seg, MemoryAddress x) {
        _GdkEventKey.window$VH.set(seg, x);
    }
    public static MemoryAddress window$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemoryAddress)_GdkEventKey.window$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void window$set(MemorySegment seg, long index, MemoryAddress x) {
        _GdkEventKey.window$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle send_event$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("send_event"));
    public static VarHandle send_event$VH() {
        return _GdkEventKey.send_event$VH;
    }
    public static byte send_event$get(MemorySegment seg) {
        return (byte)_GdkEventKey.send_event$VH.get(seg);
    }
    public static void send_event$set( MemorySegment seg, byte x) {
        _GdkEventKey.send_event$VH.set(seg, x);
    }
    public static byte send_event$get(MemorySegment seg, long index) {
        return (byte)_GdkEventKey.send_event$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void send_event$set(MemorySegment seg, long index, byte x) {
        _GdkEventKey.send_event$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle time$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("time"));
    public static VarHandle time$VH() {
        return _GdkEventKey.time$VH;
    }
    public static int time$get(MemorySegment seg) {
        return (int)_GdkEventKey.time$VH.get(seg);
    }
    public static void time$set( MemorySegment seg, int x) {
        _GdkEventKey.time$VH.set(seg, x);
    }
    public static int time$get(MemorySegment seg, long index) {
        return (int)_GdkEventKey.time$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void time$set(MemorySegment seg, long index, int x) {
        _GdkEventKey.time$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle state$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("state"));
    public static VarHandle state$VH() {
        return _GdkEventKey.state$VH;
    }
    public static int state$get(MemorySegment seg) {
        return (int)_GdkEventKey.state$VH.get(seg);
    }
    public static void state$set( MemorySegment seg, int x) {
        _GdkEventKey.state$VH.set(seg, x);
    }
    public static int state$get(MemorySegment seg, long index) {
        return (int)_GdkEventKey.state$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void state$set(MemorySegment seg, long index, int x) {
        _GdkEventKey.state$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle keyval$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("keyval"));
    public static VarHandle keyval$VH() {
        return _GdkEventKey.keyval$VH;
    }
    public static int keyval$get(MemorySegment seg) {
        return (int)_GdkEventKey.keyval$VH.get(seg);
    }
    public static void keyval$set( MemorySegment seg, int x) {
        _GdkEventKey.keyval$VH.set(seg, x);
    }
    public static int keyval$get(MemorySegment seg, long index) {
        return (int)_GdkEventKey.keyval$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void keyval$set(MemorySegment seg, long index, int x) {
        _GdkEventKey.keyval$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle length$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("length"));
    public static VarHandle length$VH() {
        return _GdkEventKey.length$VH;
    }
    public static int length$get(MemorySegment seg) {
        return (int)_GdkEventKey.length$VH.get(seg);
    }
    public static void length$set( MemorySegment seg, int x) {
        _GdkEventKey.length$VH.set(seg, x);
    }
    public static int length$get(MemorySegment seg, long index) {
        return (int)_GdkEventKey.length$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void length$set(MemorySegment seg, long index, int x) {
        _GdkEventKey.length$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle string$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("string"));
    public static VarHandle string$VH() {
        return _GdkEventKey.string$VH;
    }
    public static MemoryAddress string$get(MemorySegment seg) {
        return (java.lang.foreign.MemoryAddress)_GdkEventKey.string$VH.get(seg);
    }
    public static void string$set( MemorySegment seg, MemoryAddress x) {
        _GdkEventKey.string$VH.set(seg, x);
    }
    public static MemoryAddress string$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemoryAddress)_GdkEventKey.string$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void string$set(MemorySegment seg, long index, MemoryAddress x) {
        _GdkEventKey.string$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle hardware_keycode$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("hardware_keycode"));
    public static VarHandle hardware_keycode$VH() {
        return _GdkEventKey.hardware_keycode$VH;
    }
    public static short hardware_keycode$get(MemorySegment seg) {
        return (short)_GdkEventKey.hardware_keycode$VH.get(seg);
    }
    public static void hardware_keycode$set( MemorySegment seg, short x) {
        _GdkEventKey.hardware_keycode$VH.set(seg, x);
    }
    public static short hardware_keycode$get(MemorySegment seg, long index) {
        return (short)_GdkEventKey.hardware_keycode$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void hardware_keycode$set(MemorySegment seg, long index, short x) {
        _GdkEventKey.hardware_keycode$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle group$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("group"));
    public static VarHandle group$VH() {
        return _GdkEventKey.group$VH;
    }
    public static byte group$get(MemorySegment seg) {
        return (byte)_GdkEventKey.group$VH.get(seg);
    }
    public static void group$set( MemorySegment seg, byte x) {
        _GdkEventKey.group$VH.set(seg, x);
    }
    public static byte group$get(MemorySegment seg, long index) {
        return (byte)_GdkEventKey.group$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void group$set(MemorySegment seg, long index, byte x) {
        _GdkEventKey.group$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


