// Generated by jextract

package org.purejava.linux;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
public class _GtkTableChild {

    static final  GroupLayout $struct$LAYOUT = MemoryLayout.structLayout(
        Constants$root.C_POINTER$LAYOUT.withName("widget"),
        Constants$root.C_SHORT$LAYOUT.withName("left_attach"),
        Constants$root.C_SHORT$LAYOUT.withName("right_attach"),
        Constants$root.C_SHORT$LAYOUT.withName("top_attach"),
        Constants$root.C_SHORT$LAYOUT.withName("bottom_attach"),
        Constants$root.C_SHORT$LAYOUT.withName("xpadding"),
        Constants$root.C_SHORT$LAYOUT.withName("ypadding"),
        MemoryLayout.structLayout(
            MemoryLayout.paddingLayout(1).withName("xexpand"),
            MemoryLayout.paddingLayout(1).withName("yexpand"),
            MemoryLayout.paddingLayout(1).withName("xshrink"),
            MemoryLayout.paddingLayout(1).withName("yshrink"),
            MemoryLayout.paddingLayout(1).withName("xfill"),
            MemoryLayout.paddingLayout(1).withName("yfill"),
            MemoryLayout.paddingLayout(26)
        )
    ).withName("_GtkTableChild");
    public static MemoryLayout $LAYOUT() {
        return _GtkTableChild.$struct$LAYOUT;
    }
    static final VarHandle widget$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("widget"));
    public static VarHandle widget$VH() {
        return _GtkTableChild.widget$VH;
    }
    public static MemoryAddress widget$get(MemorySegment seg) {
        return (java.lang.foreign.MemoryAddress)_GtkTableChild.widget$VH.get(seg);
    }
    public static void widget$set( MemorySegment seg, MemoryAddress x) {
        _GtkTableChild.widget$VH.set(seg, x);
    }
    public static MemoryAddress widget$get(MemorySegment seg, long index) {
        return (java.lang.foreign.MemoryAddress)_GtkTableChild.widget$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void widget$set(MemorySegment seg, long index, MemoryAddress x) {
        _GtkTableChild.widget$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle left_attach$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("left_attach"));
    public static VarHandle left_attach$VH() {
        return _GtkTableChild.left_attach$VH;
    }
    public static short left_attach$get(MemorySegment seg) {
        return (short)_GtkTableChild.left_attach$VH.get(seg);
    }
    public static void left_attach$set( MemorySegment seg, short x) {
        _GtkTableChild.left_attach$VH.set(seg, x);
    }
    public static short left_attach$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.left_attach$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void left_attach$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.left_attach$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle right_attach$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("right_attach"));
    public static VarHandle right_attach$VH() {
        return _GtkTableChild.right_attach$VH;
    }
    public static short right_attach$get(MemorySegment seg) {
        return (short)_GtkTableChild.right_attach$VH.get(seg);
    }
    public static void right_attach$set( MemorySegment seg, short x) {
        _GtkTableChild.right_attach$VH.set(seg, x);
    }
    public static short right_attach$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.right_attach$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void right_attach$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.right_attach$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle top_attach$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("top_attach"));
    public static VarHandle top_attach$VH() {
        return _GtkTableChild.top_attach$VH;
    }
    public static short top_attach$get(MemorySegment seg) {
        return (short)_GtkTableChild.top_attach$VH.get(seg);
    }
    public static void top_attach$set( MemorySegment seg, short x) {
        _GtkTableChild.top_attach$VH.set(seg, x);
    }
    public static short top_attach$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.top_attach$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void top_attach$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.top_attach$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle bottom_attach$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("bottom_attach"));
    public static VarHandle bottom_attach$VH() {
        return _GtkTableChild.bottom_attach$VH;
    }
    public static short bottom_attach$get(MemorySegment seg) {
        return (short)_GtkTableChild.bottom_attach$VH.get(seg);
    }
    public static void bottom_attach$set( MemorySegment seg, short x) {
        _GtkTableChild.bottom_attach$VH.set(seg, x);
    }
    public static short bottom_attach$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.bottom_attach$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void bottom_attach$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.bottom_attach$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle xpadding$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("xpadding"));
    public static VarHandle xpadding$VH() {
        return _GtkTableChild.xpadding$VH;
    }
    public static short xpadding$get(MemorySegment seg) {
        return (short)_GtkTableChild.xpadding$VH.get(seg);
    }
    public static void xpadding$set( MemorySegment seg, short x) {
        _GtkTableChild.xpadding$VH.set(seg, x);
    }
    public static short xpadding$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.xpadding$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void xpadding$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.xpadding$VH.set(seg.asSlice(index*sizeof()), x);
    }
    static final VarHandle ypadding$VH = $struct$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ypadding"));
    public static VarHandle ypadding$VH() {
        return _GtkTableChild.ypadding$VH;
    }
    public static short ypadding$get(MemorySegment seg) {
        return (short)_GtkTableChild.ypadding$VH.get(seg);
    }
    public static void ypadding$set( MemorySegment seg, short x) {
        _GtkTableChild.ypadding$VH.set(seg, x);
    }
    public static short ypadding$get(MemorySegment seg, long index) {
        return (short)_GtkTableChild.ypadding$VH.get(seg.asSlice(index*sizeof()));
    }
    public static void ypadding$set(MemorySegment seg, long index, short x) {
        _GtkTableChild.ypadding$VH.set(seg.asSlice(index*sizeof()), x);
    }
    public static long sizeof() { return $LAYOUT().byteSize(); }
    public static MemorySegment allocate(SegmentAllocator allocator) { return allocator.allocate($LAYOUT()); }
    public static MemorySegment allocateArray(int len, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(len, $LAYOUT()));
    }
    public static MemorySegment ofAddress(MemoryAddress addr, MemorySession session) { return RuntimeHelper.asArray(addr, $LAYOUT(), 1, session); }
}


