// Generated by jextract

package org.purejava.appindicator;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _GdkEventKey {
 *     GdkEventType type;
 *     GdkWindow *window;
 *     gint8 send_event;
 *     guint32 time;
 *     guint state;
 *     guint keyval;
 *     gint length;
 *     gchar *string;
 *     guint16 hardware_keycode;
 *     guint8 group;
 *     guint is_modifier : 1;
 * }
 * }
 */
public class _GdkEventKey {

    _GdkEventKey() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        app_indicator_h.C_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        app_indicator_h.C_POINTER.withName("window"),
        app_indicator_h.C_CHAR.withName("send_event"),
        MemoryLayout.paddingLayout(3),
        app_indicator_h.C_INT.withName("time"),
        app_indicator_h.C_INT.withName("state"),
        app_indicator_h.C_INT.withName("keyval"),
        app_indicator_h.C_INT.withName("length"),
        MemoryLayout.paddingLayout(4),
        app_indicator_h.C_POINTER.withName("string"),
        app_indicator_h.C_SHORT.withName("hardware_keycode"),
        app_indicator_h.C_CHAR.withName("group"),
        MemoryLayout.paddingLayout(5)
    ).withName("_GdkEventKey");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * GdkEventType type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * GdkEventType type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * GdkEventType type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * GdkEventType type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final AddressLayout window$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("window"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * GdkWindow *window
     * }
     */
    public static final AddressLayout window$layout() {
        return window$LAYOUT;
    }

    private static final long window$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * GdkWindow *window
     * }
     */
    public static final long window$offset() {
        return window$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * GdkWindow *window
     * }
     */
    public static MemorySegment window(MemorySegment struct) {
        return struct.get(window$LAYOUT, window$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * GdkWindow *window
     * }
     */
    public static void window(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(window$LAYOUT, window$OFFSET, fieldValue);
    }

    private static final OfByte send_event$LAYOUT = (OfByte)$LAYOUT.select(groupElement("send_event"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gint8 send_event
     * }
     */
    public static final OfByte send_event$layout() {
        return send_event$LAYOUT;
    }

    private static final long send_event$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gint8 send_event
     * }
     */
    public static final long send_event$offset() {
        return send_event$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gint8 send_event
     * }
     */
    public static byte send_event(MemorySegment struct) {
        return struct.get(send_event$LAYOUT, send_event$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gint8 send_event
     * }
     */
    public static void send_event(MemorySegment struct, byte fieldValue) {
        struct.set(send_event$LAYOUT, send_event$OFFSET, fieldValue);
    }

    private static final OfInt time$LAYOUT = (OfInt)$LAYOUT.select(groupElement("time"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * guint32 time
     * }
     */
    public static final OfInt time$layout() {
        return time$LAYOUT;
    }

    private static final long time$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * guint32 time
     * }
     */
    public static final long time$offset() {
        return time$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * guint32 time
     * }
     */
    public static int time(MemorySegment struct) {
        return struct.get(time$LAYOUT, time$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * guint32 time
     * }
     */
    public static void time(MemorySegment struct, int fieldValue) {
        struct.set(time$LAYOUT, time$OFFSET, fieldValue);
    }

    private static final OfInt state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * guint state
     * }
     */
    public static final OfInt state$layout() {
        return state$LAYOUT;
    }

    private static final long state$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * guint state
     * }
     */
    public static final long state$offset() {
        return state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * guint state
     * }
     */
    public static int state(MemorySegment struct) {
        return struct.get(state$LAYOUT, state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * guint state
     * }
     */
    public static void state(MemorySegment struct, int fieldValue) {
        struct.set(state$LAYOUT, state$OFFSET, fieldValue);
    }

    private static final OfInt keyval$LAYOUT = (OfInt)$LAYOUT.select(groupElement("keyval"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * guint keyval
     * }
     */
    public static final OfInt keyval$layout() {
        return keyval$LAYOUT;
    }

    private static final long keyval$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * guint keyval
     * }
     */
    public static final long keyval$offset() {
        return keyval$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * guint keyval
     * }
     */
    public static int keyval(MemorySegment struct) {
        return struct.get(keyval$LAYOUT, keyval$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * guint keyval
     * }
     */
    public static void keyval(MemorySegment struct, int fieldValue) {
        struct.set(keyval$LAYOUT, keyval$OFFSET, fieldValue);
    }

    private static final OfInt length$LAYOUT = (OfInt)$LAYOUT.select(groupElement("length"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gint length
     * }
     */
    public static final OfInt length$layout() {
        return length$LAYOUT;
    }

    private static final long length$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gint length
     * }
     */
    public static final long length$offset() {
        return length$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gint length
     * }
     */
    public static int length(MemorySegment struct) {
        return struct.get(length$LAYOUT, length$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gint length
     * }
     */
    public static void length(MemorySegment struct, int fieldValue) {
        struct.set(length$LAYOUT, length$OFFSET, fieldValue);
    }

    private static final AddressLayout string$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("string"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gchar *string
     * }
     */
    public static final AddressLayout string$layout() {
        return string$LAYOUT;
    }

    private static final long string$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gchar *string
     * }
     */
    public static final long string$offset() {
        return string$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gchar *string
     * }
     */
    public static MemorySegment string(MemorySegment struct) {
        return struct.get(string$LAYOUT, string$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gchar *string
     * }
     */
    public static void string(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(string$LAYOUT, string$OFFSET, fieldValue);
    }

    private static final OfShort hardware_keycode$LAYOUT = (OfShort)$LAYOUT.select(groupElement("hardware_keycode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * guint16 hardware_keycode
     * }
     */
    public static final OfShort hardware_keycode$layout() {
        return hardware_keycode$LAYOUT;
    }

    private static final long hardware_keycode$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * guint16 hardware_keycode
     * }
     */
    public static final long hardware_keycode$offset() {
        return hardware_keycode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * guint16 hardware_keycode
     * }
     */
    public static short hardware_keycode(MemorySegment struct) {
        return struct.get(hardware_keycode$LAYOUT, hardware_keycode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * guint16 hardware_keycode
     * }
     */
    public static void hardware_keycode(MemorySegment struct, short fieldValue) {
        struct.set(hardware_keycode$LAYOUT, hardware_keycode$OFFSET, fieldValue);
    }

    private static final OfByte group$LAYOUT = (OfByte)$LAYOUT.select(groupElement("group"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * guint8 group
     * }
     */
    public static final OfByte group$layout() {
        return group$LAYOUT;
    }

    private static final long group$OFFSET = 50;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * guint8 group
     * }
     */
    public static final long group$offset() {
        return group$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * guint8 group
     * }
     */
    public static byte group(MemorySegment struct) {
        return struct.get(group$LAYOUT, group$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * guint8 group
     * }
     */
    public static void group(MemorySegment struct, byte fieldValue) {
        struct.set(group$LAYOUT, group$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

