// Generated by jextract

package org.purejava.appindicator;

import java.lang.foreign.MemoryLayout;
import java.lang.foreign.StructLayout;
import java.lang.invoke.VarHandle;

import static java.lang.foreign.ValueLayout.JAVA_INT;
import static java.lang.foreign.ValueLayout.JAVA_LONG;
final class constants$667 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$667() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("g_class")
            ).withName("g_type_instance"),
            RuntimeHelper.POINTER.withName("name"),
            JAVA_INT.withName("flags"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("value_type"),
            JAVA_LONG.withName("owner_type"),
            RuntimeHelper.POINTER.withName("_nick"),
            RuntimeHelper.POINTER.withName("_blurb"),
            RuntimeHelper.POINTER.withName("qdata"),
            JAVA_INT.withName("ref_count"),
            JAVA_INT.withName("param_id")
        ).withName("parent_instance")
    ).withName("_GParamSpecPointer");
    static final StructLayout const$1 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("g_class")
            ).withName("g_type_instance"),
            RuntimeHelper.POINTER.withName("name"),
            JAVA_INT.withName("flags"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("value_type"),
            JAVA_LONG.withName("owner_type"),
            RuntimeHelper.POINTER.withName("_nick"),
            RuntimeHelper.POINTER.withName("_blurb"),
            RuntimeHelper.POINTER.withName("qdata"),
            JAVA_INT.withName("ref_count"),
            JAVA_INT.withName("param_id")
        ).withName("parent_instance"),
        RuntimeHelper.POINTER.withName("element_spec"),
        JAVA_INT.withName("fixed_n_elements"),
        MemoryLayout.paddingLayout(4)
    ).withName("_GParamSpecValueArray");
    static final VarHandle const$2 = constants$667.const$1.varHandle(MemoryLayout.PathElement.groupElement("element_spec"));
    static final VarHandle const$3 = constants$667.const$1.varHandle(MemoryLayout.PathElement.groupElement("fixed_n_elements"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("g_class")
            ).withName("g_type_instance"),
            RuntimeHelper.POINTER.withName("name"),
            JAVA_INT.withName("flags"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("value_type"),
            JAVA_LONG.withName("owner_type"),
            RuntimeHelper.POINTER.withName("_nick"),
            RuntimeHelper.POINTER.withName("_blurb"),
            RuntimeHelper.POINTER.withName("qdata"),
            JAVA_INT.withName("ref_count"),
            JAVA_INT.withName("param_id")
        ).withName("parent_instance")
    ).withName("_GParamSpecObject");
    static final StructLayout const$5 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("g_class")
            ).withName("g_type_instance"),
            RuntimeHelper.POINTER.withName("name"),
            JAVA_INT.withName("flags"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("value_type"),
            JAVA_LONG.withName("owner_type"),
            RuntimeHelper.POINTER.withName("_nick"),
            RuntimeHelper.POINTER.withName("_blurb"),
            RuntimeHelper.POINTER.withName("qdata"),
            JAVA_INT.withName("ref_count"),
            JAVA_INT.withName("param_id")
        ).withName("parent_instance"),
        RuntimeHelper.POINTER.withName("overridden")
    ).withName("_GParamSpecOverride");
}


