// Generated by jextract

package org.purejava.appindicator;

import java.lang.foreign.MemoryLayout;
import java.lang.foreign.StructLayout;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;

import static java.lang.foreign.ValueLayout.JAVA_BYTE;
import static java.lang.foreign.ValueLayout.JAVA_INT;
final class constants$1767 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$1767() {}
    static final MethodHandle const$0 = RuntimeHelper.upcallHandle(GdkFilterFunc.class, "apply", constants$12.const$2);
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("window"),
        JAVA_BYTE.withName("send_event"),
        MemoryLayout.paddingLayout(7)
    ).withName("_GdkEventAny");
    static final VarHandle const$2 = constants$1767.const$1.varHandle(MemoryLayout.PathElement.groupElement("type"));
    static final VarHandle const$3 = constants$1767.const$1.varHandle(MemoryLayout.PathElement.groupElement("window"));
    static final VarHandle const$4 = constants$1767.const$1.varHandle(MemoryLayout.PathElement.groupElement("send_event"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("type"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("window"),
        JAVA_BYTE.withName("send_event"),
        MemoryLayout.paddingLayout(3),
        MemoryLayout.structLayout(
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height")
        ).withName("area"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("region"),
        JAVA_INT.withName("count"),
        MemoryLayout.paddingLayout(4)
    ).withName("_GdkEventExpose");
}


